In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/foo.csv')

In [4]:
df.head()

   id firstName     lastName  billingId product  price       birth dummyCol
0   1      Luis  Alvarez$$%!        123    Cake     10  07-07-1980    never
1   2     André       Ampère        423    piza      8  08-07-1950    gonna
2   3     NiELS   Böhr//((%%        551   pizza      8  09-07-1990     give
3   4      PAUL       dirac$        521   pizza      8  10-07-1954      you
4   5    Albert     Einstein        634   pizza      8  11-07-1990       up

In [7]:
avg_price = df['price'].mean()

In [12]:
df_price = df.loc[df['price'] <= 5]

In [13]:
df_price['price'].mean()

3.2222222222222223

In [18]:
odds = range(1, 19, 2)

In [19]:
df.iloc[odds]

,id,firstName,lastName,billingId,product,price,birth,dummyCol
1,2,André,Ampère,423,piza,8,08-07-1950,gonna
3,4,PAUL,dirac$,521,pizza,8,10-07-1954,you
5,6,Galileo,GALiLEI,672,arepa,5,12-08-1930,never
7,8,David,H$$$ilbert,624,taaaccoo,3,14-07-1950,let
9,10,JaMES,M$$ax%%well,875,taco,3,12-03-1923,down
11,12,Emmy%%,Nöether$,234,pasta,9,08-12-1993,gonna
13,14,Fred,Hoy&&&le,553,pizzza,8,27-06-1997,around
15,16,William,Gilbert###,886,BEER,2,26-03-1958,desert
17,18,Arthur,COM%%%pton,812,110790,5,1899/01/01,#

In [25]:
df.iloc[1::2]

,id,firstName,lastName,billingId,product,price,birth,dummyCol
1,2,André,Ampère,423,piza,8,08-07-1950,gonna
3,4,PAUL,dirac$,521,pizza,8,10-07-1954,you
5,6,Galileo,GALiLEI,672,arepa,5,12-08-1930,never
7,8,David,H$$$ilbert,624,taaaccoo,3,14-07-1950,let
9,10,JaMES,M$$ax%%well,875,taco,3,12-03-1923,down
11,12,Emmy%%,Nöether$,234,pasta,9,08-12-1993,gonna
13,14,Fred,Hoy&&&le,553,pizzza,8,27-06-1997,around
15,16,William,Gilbert###,886,BEER,2,26-03-1958,desert
17,18,Arthur,COM%%%pton,812,110790,5,1899/01/01,#

In [23]:
df.iloc[range(0, 19, 2)]

,id,firstName,lastName,billingId,product,price,birth,dummyCol
0,1,Luis,Alvarez$$%!,123,Cake,10,07-07-1980,never
2,3,NiELS,Böhr//((%%,551,pizza,8,09-07-1990,give
4,5,Albert,Einstein,634,pizza,8,11-07-1990,up
6,7,CaRL,Ga%%%uss,323,taco,3,13-07-1970,gonna
8,9,Johannes,KEPLER,735,taco,3,22-04-1920,you
10,11,Isaac,Newton,992,pasta,9,15-02-1999,never
12,13,Max!!!,Planck!!!,111,hamburguer,4,04-01-1994,run
14,15,((( Heinrich ))))),Hertz,116,pizza,8,30-11-1956,and
16,17,Marie,CURIE,912,Rice,1,22-03-2000,you
18,19,JAMES,Chadwick,467,NaN,10,03-05-1921,#

### `apply` et al

In [28]:
def increaser(x): return x[0]

In [35]:
df[['firstName', 'lastName']].apply(increaser, axis = 1)

0                     Luis
1                    André
2                    NiELS
3                     PAUL
4                   Albert
5                  Galileo
6                     CaRL
7                    David
8                 Johannes
9                    JaMES
10                   Isaac
11                  Emmy%%
12                  Max!!!
13                    Fred
14    (((   Heinrich )))))
15                 William
16                   Marie
17                  Arthur
18                   JAMES
dtype: object

In [32]:
df['product'].dropna().apply(increaser)

0     C
1     p
2     p
3     p
4     p
5     a
6     t
7     t
8     t
9     t
10    p
11    p
12    h
13    p
14    p
15    B
16    R
17    1
Name: product, dtype: object

In [42]:
df['firstName'].map({'Luis': 'Louis'}, na_action = None)

0     Louis
1       NaN
2       NaN
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
8       NaN
9       NaN
10      NaN
11      NaN
12      NaN
13      NaN
14      NaN
15      NaN
16      NaN
17      NaN
18      NaN
Name: firstName, dtype: object

In [44]:
df['firstName'].apply(lambda x: x[0])

0     L
1     A
2     N
3     P
4     A
5     G
6     C
7     D
8     J
9     J
10    I
11    E
12    M
13    F
14    (
15    W
16    M
17    A
18    J
Name: firstName, dtype: object

In [52]:
plus_ten_a = lambda x: x[0]

In [53]:
def plus_ten_b(x): return x[0]

In [54]:
import sys

In [56]:
sys.getsizeof(plus_ten_a)

136

In [57]:
sys.getsizeof(plus_ten_b)

136

In [48]:
df['firstName'].apply(plus_ten)

0     L
1     A
2     N
3     P
4     A
5     G
6     C
7     D
8     J
9     J
10    I
11    E
12    M
13    F
14    (
15    W
16    M
17    A
18    J
Name: firstName, dtype: object